import { Component } from '@angular/core';
import { IonicPage, NavController, NavParams } from 'ionic-angular';

/**
 * Generated class for the MorePage page.
 *
 * See https://ionicframework.com/docs/components/#navigation for more info on
 * Ionic pages and navigation.
 */

@IonicPage()
@Component({
  selector: 'page-more',
  templateUrl: 'more.html',
})
export class MorePage {

	promotions : Array<any> = [] ;
  	constructor(public navCtrl: NavController, public navParams: NavParams) {
  		this.promotions = [
  			{name:"Black Full Moon Promotion", subname:"Black Full Moon Promotion",
			detail:"ชมภาพยนตร์เรื่อง วันหมาหอนที่ค่ายลูกเสือ (Black Full Moon) ในราคาพิเศษ 79 บาท , 89 บาท และ 99 บาท (Deluxe Seat) ที่โรงภาพยนตร์ในเครือเอส เอฟ ทุกสาขาที่ร่วมรายการ -  สาขาที่ราคา 79 บาท (Deluxe Seat) , 99 บาท (Premium Seat) : เดอะสแควร์บางใหญ่ , สุนีย์ ทาวเวอร์ อุบลราชธานี , โรบินสัน บุรีรัมย์	-  สาขาที่ราคา 89 บาท (Deluxe Seat) , 109 บาท (Premium Seat) : โรบินสันศรีสมาน , บิ๊กซีบางพลี , แลนด์มาร์คพลาซ่า อุดรธานี , เซ็นทรัลขอนแก่น  , โรบินสัน สุรินทร์ , เสริมไทย คอมเพล็กซ์ มหาสารคาม -  สาขาที่ราคา 99 บาท (Deluxe Seat) , 119 บาท (Premium Seat) : เดอะมอลล์บางกะปิ , เดอะมอลล์งามวงศ์วาน " ,
			date:"ตั้งแต่วันที่ 12 ตุลาคม 2560 – ตลอดโปรแกรมฉาย", 
			condition:["สามารถซื้อบัตรชมภาพยนตร์ เรื่อง วันหมาหอนที่ค่ายลูกเสือ (Black Full Moon) ในราคาพิเศษ 79 บาท , 89 บาท , 99 บาท (Deluxe Seat) และ 99 บาท , 109 บาท , 119 บาท (Premium Seat) ที่โรงภาพยนตร์ในเครือ เอส เอฟ ทุกสาขาที่ภาพยนตร์เข้าฉายทั่วประเทศ",
			"สามารถรับส่วนลดได้ตั้งแต่วันที่ 12 ตุลาคม 2560 – ตลอดโปรแกรมฉาย","สามารถซื้อบัตรชมภาพยนตร์ได้เฉพาะที่จุดจำหน่ายบัตรชมภาพยนตร์เท่านั้น","ไม่สามารถใช้ร่วมกับบัตรส่วนลด หรือกิจกรรมส่งเสริมด้านราคาอื่นๆ",
			"สามารถใช้ร่วมกับกิจกรรม SF-COKE Movie Plus ดูหนัง 2 เรื่องฟรีเรื่องที่ 3"," ไม่สามารถแลก เปลี่ยน หรือทอนเป็นเงินสดได้"," บริษัทขอสงวนสิทธิ์ในการเปลี่ยนแปลงรายละเอียดโดยไม่ต้องแจ้งให้ทราบล่วงหน้า"],
			branches:"โรงภาพยนตร์ในเครือ เอส เอฟ ทุกสาขาทั่วประเทศที่เข้าฉาย",
			pic:"Black Full Moon Pro.jpg"
			},
	
			{name:"สิทธิพิเศษสำหรับลูกค้าใหม่ที่ดาวน์โหลด Application SF Cinema รับ Popcorn Size M ฟรี", subname:"โหลด Application SF Cinema...",
			detail:"สิทธิพิเศษสำหรับลูกค้าใหม่ที่ดาวน์โหลด  Application SF Cinema บริเวณหน้าจุดจำหน่ายบัตรชมภาพยนตร์เท่านั้น  รับคูปองแจกฟรี Popcorn Size M จำนวน 1 กล่อง" ,
			date:"ตั้งแต่วันที่ 16 ตุลาคม – 15 ธันวาคม 2560 (หรือจนกว่าจะครบ 30,000 สิทธิ์)", 
			condition:["สิทธิพิเศษนี้สำหรับลูกค้าใหม่ที่ดาวน์โหลด Application SF Cinema ครั้งแรกเท่านั้น"," ลูกค้าสามารถใช้สิทธิ์โดยแสดงคูปองฟรี Popcorn Size M ที่หน้าจุดจำหน่ายเครื่องดื่มและป๊อปคอร์น",
			"ไม่สามารถใช้สิทธิ์ร่วมกับกิจกรรมส่งเสริมการขายรายการอื่นๆได้","ลูกค้าไม่สามารถ Upgrade Size หรือเปลี่ยนเป็นชุดอื่นได้","ลูกค้าไม่สามารถแลกเปลี่ยน หรือทอนเป็นเงินสดได้","ลูกค้าสามารถนำคูปองไปแลกรับ Popcorn Size M ฟรีได้ถึงวันที่ 31 ธันวาคม 2560 ",
			"บริษัทขอสงวนสิทธิ์ในการเปลี่ยนแปลงรายละเอียดโดยไม่ต้องแจ้งให้ทราบล่วงหน้า","จำกัด 1 ดาวน์โหลด /1คน /1 สิทธิ์","ลูกค้าสามารถรับคูปองได้ถึงวันที่ 15 ธันวาคม 2560"],
			branches:"โรงภาพยนตร์ในเครือ เอส เอฟ ทุกสาขา ยกเว้นสาขาบิ๊กซี ปราจีนบุรี",
			pic:"Application SF Cinema Pro.jpg"
			},

			{name:"Samsung Pay Promotion", subname:"Samsung Pay Promotion",
			detail:"ลูกค้าใหม่ที่ลงทะเบียน Samsung Pay ด้วยบัตร Mastercard และได้รับโค้ดรับสิทธิ์" ,
			date:"ตั้งแต่วันที่ 18 กันยายน - 31 ธันวาคม 2560", 
			condition:["ลูกค้า Samsung Galaxy ต้องทำการลงทะเบียน Samsung Pay และ เพิ่มบัตรเครดิต Mastercard ใน Samsung Pay เพื่อรับสิทธิ์ซื้อบัตรชมภาพยนตร์ประเภท Deluxe Seat (2D) จำนวน 1 ที่นั่ง ราคาที่นั่งละ 8 บาท",
			"ลูกค้าต้องชำระเงินค่าบัตรชมภาพยนตร์ผ่านบัตรเครดิต Mastercard ที่ลงทะเบียน Samsung Pay เท่านั้น","สามารถรับสิทธิ์ได้เพียง 1 สิทธิ์ ต่อสมาร์ทโฟน 1 เครื่อง ต่อบัตรเครดิต Mastercard 1 ใบ",
			"จำกัดสิทธิ์เฉพาะลูกค้า 10,000 ท่านแรก ที่ทำการเพิ่มบัตรเครดิต Mastercard ใน Samsung Pay พร้อมใช้ซื้อสินค้าหรือบริการอย่างน้อย 1 ครั้งในระยะเวลากิจกรรม ตั้งแต่วันที่ 18 กันยายน - 31 ธันวาคม 2560",
			"โค้ดดังกล่าวไม่สามารถแลกเปลี่ยน หรือทอนเป็นเงินสดได้"," บริษัทฯ ขอสงวนสิทธิ์ในการเปลี่ยนแปลงเงื่อนไขโดยไม่ต้องแจ้งให้ทราบล่วงหน้า"],
			branches:"โรงภาพยนตร์ในเครือ SF ทุกสาขา (ยกเว้น Emprive’ Cineclub และสาขาบิ๊กซี ปราจีนบุรี)",
			pic:"Samsung Pay Pro.jpg"
			},

			{name:"Central The 1 Credit Card Promotion", subname:"The 1 Credit Card Promotion",
			detail:"สิทธิพิเศษ ส่วนลด 50% สำหรับที่นั่งเฟิร์สคลาส ระบบ Digital 2D ทุกเรื่องทุกรอบ พร้อมบริการห้องรับรองพิเศษ ด้วยเครื่องดื่มและอาหารว่าง,ลูกค้าต้องชำระด้วยบัตรเครดิต เซ็นทรัล เดอะวัน เดอะแบล็ค และแบล็ค เท่านั้น" ,
			date:"ตั้งแต่วันที่ 5 มีนาคม 2560 – 28 กุมภาพันธ์ 2561", 
			condition:["จำกัดส่วนสดสูงสุด 2 ใบ/ บัตร/ วัน","จำกัดสิทธิ์ทั้งหมด 80 สิทธิ์ต่อเดือน สำหรับบัตรเครดิต เซ็นทรัล เดอะวัน แบล็ค "],
			branches:"โรงภาพยนตร์เอส เอฟ เวิลด์ ซีเนม่า สาขาเซ็นทรัลเวิลด์ เท่านั้น",
			pic:"1 Credit Card Pro.jpg"
			},

			{name:"Emprivé Cineclub Movie Night Promotion", subname:"Emprivé Cineclub Movie Night",
			detail:"วันอาทิตย์ - วันพุธ หลัง 21.00 น ชมภาพยนตร์ในราคาพิเศษ เริ่มต้นเพียง 200 บาท" ,
			date:"ตั้งแต่วันที่ 9 กุมภาพันธ์ 2559 เป็นต้นไป", 
			condition:["ลูกค้าสามารถรับสิทธิ์ชมภาพยนตร์ ในราคา Movie Night Price คือราคา เริ่มต้น 200 บาท ต่อที่นั่ง","สามารถมารับสิทธิ์ได้ทุกเรื่อง ในรอบฉายหลัง  เวลา 21.00 น. เฉพาะที่นั่ง Executive Seat เท่านั้น",
			"โปรโมชั่นดังกล่าวสามารถใช้สิทธิ์ในวันหยุดพิเศษได้ เฉพาะ วันหยุดพิเศษที่ตรงกับกับ วันจันทร์ - อังคาร ชำระค่าบัตรชมภาพยนตร์ในฐานราคา Movie Night Price ของวันอาทิตย์","บริษัทขอสงวนสิทธิ์ในการเปลี่ยนแปลงโปรโมชั่นดังกล่าว โดยไม่ต้องแจ้งให้ทราบล่วงหน้า"],
			branches:"โรงภาพยนตร์ Emprivé Cineclub",
			pic:"Movie Night Pro.jpg"
			}
  		];
  	}

  	ionViewDidLoad() {
    	console.log('ionViewDidLoad MorePage');
  	}

}
