import { Component } from '@angular/core';
import { IonicPage, NavController, NavParams } from 'ionic-angular';

/**
 * Generated class for the ShowingPage page.
 *
 * See https://ionicframework.com/docs/components/#navigation for more info on
 * Ionic pages and navigation.
 */

@IonicPage()
@Component({
  selector: 'page-showing',
  templateUrl: 'showing.html',
})
export class ShowingPage {
  movies: Array<any> = [];

  constructor(public navCtrl: NavController, public navParams: NavParams) {
    this.movies = [
      {
        nameTh: "วันหมาหอนที่ค่ายลูกเสือ", nameEn: "Black Full Moon", Date: "12 October 2017", Type: "Horror", Rate: "15+",
        pic: "full moon.jpg",
        minutes: "85", Directed: "พิรุณ อนุสุริยา", Starring: [],
        plot: "เรื่องราวการหายตัวไปอย่างลึกลับของกลุ่มวัยรุ่น 5 คน ที่เป็นที่รู้จักในโซเชียลมีเดีย ผู้ทำรายการในยูทูปที่ชื่อ เกรียนท้าผี ทางตำรวจได้เข้าไปพบกล้องที่บันทึกเหตุการณ์ หลังพบศพทั้งห้าเสียชีวิตโดยปริศนาในค่ายลูกเสือร้างจังหวัดระยอง ผู้รอดชีวิตในเหตุการณ์นั้น ได้แก่ ทีมงานเบื้องหลัง 3 คน ได้ให้การว่าพวกตนได้เข้าไปในค่ายลูกเสือตามคำชักชวนของโปรดิวเซอร์ดัง ฟลินท์ ศุภชัย พร้อมด้วย หมีเพื่อนผี นักเล่าเรื่องเจ้าของเรื่องดังอย่าง ผีค่ายลูกเสือ และนั่นเป็นที่มาของการกระทบกระทั่งจนดีเจชื่อดังอย่าง บุ๊คโกะ ขอถอนตัวจากรายการนี้กลางคัน โดยไม่ทราบเลยว่าต่อมาทั้งห้าคนในรายการได้เสียชีวิตลง ในเบื้องต้นยังไม่พบมูลเหตุแห่งการฆาตกรรม แต่ทุกศพต่างมีร่องรอยของการต่อสู้ โดยเรื่องราวที่จะได้ชมคือเหตุการณ์บางส่วนที่ยังคลุมเครือ แต่กล้องบันทึกเอาไว้ได้"
      },

      {
        nameTh: "เมฆาถล่มโลก", nameEn: "Geostorm", Date: "12 October 2017", Type: "Action", Rate: "ทั่วไป",
        pic: "geostorm.jpg",
        minutes: "110", Directed: "ดีน เดฟลิน", Starring: ["Gerard Butler", "Jim Sturgess", "Abbie Cornish", "Ed Harris", "Andy Garcia"],
        plot: "ในอนาคตอันอีกไม่ไกล โลกจะมีดาวเทียมเพื่อช่วยควบคุมภูมิอากาศให้ทุกอย่างปกติ แต่วันดีคืนดี เจ้าดาวเทียมตัวนี้เกิดขัดข้องแล้วมันก็ก่อให้เกิดมหาภัยพิบัติทางธรรมชาติขึ้นทั่วโลก ทั้งสึนามิ, พายุลูกเห็บ, ลาวา, ทอร์นาโด, อากาศหนาวจัด และอีกมากมาย แต่โชคยังดีอยู่บ้างที่โลกมีนักวิศวกรด้านวิทยาศาสตร์ที่รับบทโดยเจอราร์ด บัตเลอร์ และเขาคือความหวังเดียวของมนุษยชาติที่จะขึ้นสู่อวกาศไปซ่อมเจ้าดาวเทียมเครื่องนี้ เรื่องราวสุดระทึกใน Geostorm เกิดขึ้นเมื่อดาวเทียมควบคุมภูมิอากาศของโลกเกิดความเสียหาย จนทำให้สภาพอากาศทั่วโลกแปรปรวนถึงขีดสุด แต่เมื่อชายสองพี่น้องเดินทางขึ้นไปซ่อมแซมดาวเทียมในอวกาศ สิ่งที่พวกเขาค้นพบคือแผนการลอบสังหารประธานาธิบดีสหรัฐฯ ที่ซ่อนอยู่เบื้องหลังหายนะครั้งนี้ "
      },

      {
        nameTh: "คนพันธุ์กูล", nameEn: "Tokyo Ghoul", Date: "12 October 2017", Type: "Action", Rate: "18+",
        pic: "tokyo.jpg",
        minutes: "120", Directed: "Kentaro Hagiwara", Starring: ["Yu Aoi", "Masataka Kubota", "Yo Oizumi"],
        plot: "เรื่องราวของ คาเนกิ เคน นักศึกษามหาลัยที่ชอบอ่านหนังสือเป็นชีวิตจิตใจ เขาพบกับ ริเสะ สาวในร้านคาเฟ่ที่ชอบไปประจำ เพราะความชอบที่เหมือนกันทำให้ทั้งคู่สนิทกันได้เร็ว แต่แล้วคืนหนึ่งชีวิตของเขาก็ต้องเปลี่ยนไปตลอดกาล เพราะความจริงแล้ว ริเสะ คือ กูล สิ่งมีชีวิตที่กินมนุษย์เป็นอาหาร ถึงแม้ว่า คาเนกิ จะมีชีวิตรอดจากการถูกกิน แต่เขาก็บาดเจ็บหนักจนต้องเปลี่ยนถ่ายอวัยวะ แต่เมื่อฟิ้นเขาก็ค้นพบว่าตัวเองได้กลายเป็นครึ่งมนุษย์ครึ่งกูล และไม่สามารถทานอาหารของมนุษย์ได้อีกต่อไป คาเนกิ ยังค้นพบว่าร้านกาแฟ อันเทย์คุ นั่นคือเป็นแหล่งรวมตัวของเหล่ากูล และมันก็คือจุดเริ่มต้นของเขาในการใช้ชีวิตสายพันธุ์ใหม่ในมหานครโตเกียว"
      },

      {
        nameTh: "มาย ลิตเติ้ลโพนี่ เดอะมูฟวี่", nameEn: "My Little Pony : The Movie", Date: "12 October 2017", Type: " Animation", Rate: "ทั่วไป",
        pic: "pony.jpg",
        minutes: "100", Directed: "Jayson Thiessen", Starring: ["Uzo Aduba", "Emily blunt", "Zoe Saldana"],
        plot: "When a dark force threatens Ponyville and the Mane 6, they go on a journey to the end of Equestria to save their beloved home and they meet new friends and dangerous challenges along the way."
      },

      {
        nameTh: "ราชินีและคนสนิท", nameEn: "Victoria and abdul", Date: "12 October 2017", Type: " Animation", Rate: "13",
        pic: "victoria.jpg",
        minutes: "125", Directed: "Stephen Frears", Starring: ["Judi Dench", "Ali Fazal", "Eddie Izzard"],
        plot: "เรื่องราวของความสัมพันธ์อันละเอียดอ่อนและค่อนข้างเป็นความลับของ สมเด็จพระราชินีวิคตอเรีย แห่งอังกฤษ กับคุณครูหนุ่มชาวอินเดียผู้ใกล้ชิด มีหน้าที่เป็นเลขานุการอินเดียประจำพระองค์ คอยถวายคำปรึกษาและคำแนะนำต่างๆ เกี่ยวกับกิจการของอินเดีย ทั้งการเมือง เศรษฐกิจ สังคม วัฒนธรรม รวมทั้งยังมีการสอนภาษาฮินดีและอูรดูแก่ราชินีอีกด้วย เด็กหนุ่มมุสลิมผู้นั่นมีนามว่า Abdul Karim"
      },

      {
        nameTh: "นายไข่เจียวเสี่ยวตอร์ปิโด", nameEn: "", Date: "05 October 2017", Type: "Comedy", Rate: "15+",
        pic: "KaiJeaw.jpg",
        minutes: "100", Directed: "ปริภัณฑ์ วัชรานนท์", Starring: ["ก้อง ห้วยไร่", "สิงโต นำโชค", "เซฟฟานี่ อาวะนิค"],
        plot: "เมื่อพี่โต๊ะ พันธมิตร เจ้าพ่อเสียงพากย์สุดหล่อพร้อมมุกแพรวพราว คันไม้คันมืออยากจะจัดหนังสนุก เฮฮา อีกซักเรื่องต่อจาก มนต์เลิฟสิบหมื่น ครั้งนี้จับ ก้อง ห้วยไร่ มาลงจอภาพยนตร์ครั้งแรก ปะทะสิงโต นำโชค กับเรื่องไข่ๆ ไอเดียบรรเจิด ที่เอาไข่เจียวอาหารเด็ดของคนไทยไม่แพ้ชาติใดในโลกมาเป็นอีกหนึ่งตัวละคร ถ่ายทอดเรื่องราวฟูฟูไปด้วยเสน่ห์ของรอยยิ้มและเสียงหัวเราะในแบบอารมณ์ดีสุดๆ ของมิตรภาพกลุ่มเพื่อนที่มีไข่เจียวเป็นศูนย์กลางกับภารกินดัน ไข่เจียวไทย ไปเป็น ไข่เจียวโลก เพิ่มรสชาติความสนุก ระเบิดระเบ้อเสียงหัวเราะแบบไม่มีกั๊กด้วย บอล เชิญยิ้ม ระดมเหล่าศิลปิน +ซูเปอร์สตาร์สุดเซอร์ไพรส์อีกเพียบ รับรองว่าดูเรื่องนี้ได้ทั้งความฮา ความหิว และร้องโอ้โห ชัวๆ"
      },

      {
        nameTh: "The lego ninjago movie", nameEn: "The lego ninjago movie", Date: "05 October 2017", Type: "Animation", Rate: "ทั่วไป",
        pic: "lego.jpg",
        minutes: "100", Directed: "Charlie Bean", Starring: ["Dave Franco", "Olivia Munn", "Justin Theroix"],
        plot: "การต่อสู้เพื่อเมืองนินจาโกที่ต้องอาศัยลอยด์ผู้เยาว์วัย หรือในชื่อว่านินจาเขียว พร้อมกับเพื่อนๆ ของเขาที่ล้วนเป็นนักรบปริศนาและ LEGO Master Builders ที่นำโดย ปรมาจารย์กังฟูวู ผู้มีความอัจฉริยะปราดเปรื่อง พวกเขาต้องต่อสู้เอาชนะผู้นำที่ชั่วร้ายอย่างการ์มาดอน ผู้ร้ายตลอดกาลที่กลายเป็นพ่อของลอยด์ การเผชิญหน้าระหว่างจักรกลต่อจักรกล พ่อกับลูก การเผชิญหน้าครั้งใหญ่นี้จะเป็นบททดสอบนินจารุ่นใหม่ที่มีความโหดเหี้ยมแต่ไร้ระเบียบวินัย ซึ่งพวกเขาจะได้เรียนรู้วิธีตรวจสอบอีโก้ของตัวเอง และรู้จักควบคุมอารมณ์เพื่อแสดงพลังที่แท้จริงของพวกเขาออกมา"
      },

      {
        nameTh: "เบลด รันเนอร์ 2049", nameEn: "Blade Runner 2049", Date: "05 October 2017", Type: "Sci - Fi", Rate: "15+",
        pic: "blade.jpg",
        minutes: "165", Directed: "Denis Villeneuve", Starring: ["Ana de Armas", "Harrison Ford", "Ryan Gosling"],
        plot: "เป็นเรื่องราวใน 30 ปีให้หลังจากภาคแรก เมื่อเจ้าหน้าที่เค (Officer K) ซึ่งนำแสดงโดย Ryan Gosling ที่เป็น เบลดรันเนอร์ (Blade Runner) คนล่าสุดได้เข้ามาประจำการที่เมืองลอสแอนเจลิส  ซึ่งเขาได้พยายามสืบข้อมูลของ ริค เดซคาร์ด(Rick Deckard) ซึ่งนำแสดงโดย Harrison Ford บุคคลหายสาบสูญไปนานถึงสามสิบปีเต็ม"
      },

      {
        nameTh: "2 โคตรพยัคฆ์ผู้ยิ่งใหญ่", nameEn: "The Foreigner", Date: "28 September 2017", Type: "Action", Rate: "15+",
        pic: "foreigner.jpg",
        minutes: "110", Directed: "Martin Campbell", Starring: ["Charlie Murphy", "Jackie Chan", "Pierce Brosnan"],
        plot: "ไม่ต้องให้รอนานจนคิดถึง เร็วๆ นี้ เตรียมพบกับมหากาพย์แอ็คชั่นครั้งใหม่ของพระเอกหนังบู๊ผู้เป็นตำนาน แจ๊คกี้ ชาน กลับมาลุยอีกครั้งใน The Foreigner ในครั้งนี้เขารับบทเจ้าของภัตตราคารอาหารจีนในลอนดอนที่เป็นที่รักของลูกค้า จู่ๆ วันหนึ่งลูกและภรรยาของเขาถูกกลุ่มกบฏ IRA ลักพาตัวไป เมื่อไปขอความช่วยเหลือจากตำรวจพวกเขากลับทาเป็นไม่รู้ไม่เห็น เขาต้องลงมือทวงทั้งคู่คืนมาด้วยตัวของเขาเองด้วยวิธีสุดระห่ำที่จะทำให้ทุกคนลืมภาพคุณลุงผู้ใจดีไปหมดสิ้น สร้างจากนิยายขายดีเรื่อง The Chinaman ที่วางจำหน่ายเมื่อปี 2008 จากปลายปากกาของ สตีเฟ่น เลเธอร์ นักเขียนแนวเขย่าขวัญอาชญากรรมชื่อดัง ได้ผู้กำกับมากฝีมืออย่าง มาร์ติน แคมป์เบลล์ ที่ฝากฝีมือไว้ในเฟรนไชส์สายลับตลอดการ เจมส์ บอนด์ มาแล้วใน Casino Royale และ Goldeneye เท่านั้นยังไม่พอยังได้ เพียซ บรอสแนน อดีตสายลับ 007 ตัวจริงมาร่วมสร้างสีสัน เขารับบทเป็นอดีตสมาชิก IRA ที่กลับตัวมาเป็นเจ้าหน้าที่ให้รัฐบาล หนังเรื่องนี้เป็นการโคจรกลับมาร่วมงานกันครั้งแรกของ แคมป์เบลล์ และ บรอสแนน หลังจาก Goldeneye เมื่อปี 1995"
      },

      {
        nameTh: "คิงส์แมน เดอะ โกลเด้น เซอร์เคิล", nameEn: "Kingsman: The Golden Circle", Date: "21 September 2017", Type: "Action", Rate: "15+",
        pic: "kingsman.jpg",
        minutes: "140", Directed: "Matthew Vaughn", Starring: ["Taron Egerton", "Colin Firth", "Mark Strong"],
        plot: "Kingsman: The Golden Circle จะเดินเรื่องต่อจากเหตุการณ์การโจมตีทั่วโลกในท้ายภาคแรก โดยที่ เอ็กซ์ซี่ (ทารอน อีเกอร์ตัน) และ เมอร์ลิน (มาร์ค สตรอง) มุ่งหน้าไปยังสหรัฐอเมริกา เพื่อร่วมทีมกับฝั่งสำนักงานใหญ่ในอเมริกาช่วยกันกอบกู้โลก ซึ่งทางฝั่งสหรัฐอเมริกานั้นก็ได้นักแสดงอย่าง ฮัลลี่ เบอร์รี่ มานำทีมด้วย"
      },

      {
        nameTh: "ก้าวเดินกับฉัน", nameEn: "Walk With Me", Date: "21 September 2017", Type: "DOCUMENTARY", Rate: "ทั่วไป",
        pic: "walk.jpg",
        minutes: "90", Directed: "Marc J. Francis", Starring: ["Benedict", "Thich Nhat"],
        plot: "เรื่องราวของหลวงปู่ ติช นัท ฮันห์ เป็นพระภิกษุชาวเวียดนาม ผู้นำเสนอความคิด พุทธศาสนาต้องเป็นส่วนหนึ่งของชีวิตประจำวัน และพุทธธรรม เป็นสิ่งที่สามารถประยุกต์ใช้ให้เข้ากับวิธีชีวิตยุคปัจจุบันได้"
      },

      {
        nameTh: "เพื่อน..ที่ระลึก", nameEn: "The Promise", Date: "7 September 2017", Type: "Horror", Rate: "18+",
        pic: "friend.jpg",
        minutes: "115", Directed: "โสภณ ศักดาพิศิษฏ์", Starring: [],
        plot: "เมื่อ คำสัญญา และ เพื่อนรัก จะกลับมาทำให้คุณระลึกและระทึกไปพร้อมกันผ่านไป 20 ปี บุ๋ม (บี น้ำทิพย์ จงรัชตวิบูลย์) เติบโตกลายเป็นนักธุรกิจด้านอสังหาริมทรัพย์ และได้กลับไปที่ตึกนั้นอีกครั้ง พร้อมกับ เบล (ลิลลี่ อภิชญา ทองคำ) ลูกสาวผู้เป็นทุกสิ่งทุกอย่างในชีวิตของเธอคืนนั้นหลังกลับจากตึกก็เกิดเรื่องประหลาดขึ้นกับเบล เมื่อบุ๋มตื่นขึ้นมาพบเบลนั่งคุยกับใครบางคน แม้จะอยู่ในความมืด บุ๋มก็รู้ว่าที่นั่งฝั่งตรงข้ามของเบลว่างเปล่า ไม่มีใครเลย แล้วทุกคืนหลังจากนั้นก็กลายเป็นฝันร้ายของบุ๋ม เมื่อทุกครั้งที่หลับตานอน เบลจะตื่นขึ้นมาด้วยอาการละเมอที่หนักขึ้นเรื่อยๆ และที่ร้ายแรงที่สุดก็คือ เบลจะละเมอพูดหรือทำในสิ่งที่ทำให้บุ๋มระลึกถึง อิ๊บ เพื่อนเก่าที่เธอทิ้งให้รออยู่ที่ตึกอย่างโดดเดี่ยวมาเป็นเวลานาน นี่อาจเป็นการกลับมาทวงคำสัญญาสุดท้ายที่อิ๊บเคยขอไว้ก่อนจากโลกนี้ไป...สัญญานะ ว่าแกจะไม่ปล่อยให้ฉันตายคนเดียว"
      },





    ];
  }


  ionViewDidLoad() {
    console.log('ionViewDidLoad ShowingPage');
  }

}
